In [2]:
import pandas as pd

1. Read the file into a dataframe.

In [3]:
df = pd.read_csv("data/iris_dirty.csv")

In [6]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [4]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    153.000000   153.000000    153.000000   148.000000
mean       5.844444     3.056209      3.784314     1.245270
std        0.819892     0.431617      1.757732     0.748453
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.400000
50%        5.800000     3.000000      4.400000     1.400000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [7]:
df.head(4)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          NaN  Setosa
1           4.9          3.0           1.4          NaN  Setosa
2           4.7          3.2           1.3          NaN  Setosa
3           4.6          3.1           1.5          NaN  Setosa

In [8]:
df.tail(4)

     sepal.length  sepal.width  petal.length  petal.width    variety
149           5.9          3.0           5.1          1.8  Virginica
150           5.9          3.0           5.1          1.8  Virginica
151           5.9          3.0           5.1          1.8  Virginica
152           5.9          3.0           5.1          1.8  Virginica

2. The first five values in petal_width are blank. In a new dataframe, remove the petal_width column.

In [9]:
df.isnull().sum()

sepal.length    0
sepal.width     0
petal.length    0
petal.width     5
variety         0
dtype: int64

In [10]:
df.isnull().sum().sum()

5

In [19]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [20]:
df_column_dropped = df.drop(columns =['petal.width'])

In [21]:
df_column_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  153 non-null    float64
 1   sepal.width   153 non-null    float64
 2   petal.length  153 non-null    float64
 3   variety       153 non-null    object
dtypes: float64(3), object(1)
memory usage: 4.9+ KB

3. In a new dataframe, replace the blank values with the average petal width for Setosa varieties. (If you are having trouble with this, it may be best to break your work into multiple lines.)

In [23]:
df.isnull().sum()

sepal.length    0
sepal.width     0
petal.length    0
petal.width     5
variety         0
dtype: int64

In [24]:
df.isnull().sum().sum()

5

In [37]:
pivot_df = pd.pivot_table(df, index='variety', values='petal.width')      
pivot_df

            petal.width
variety
Setosa         0.251111
Versicolor     1.326000
Virginica      2.013208

In [38]:
df_nonull = df.fillna(value = .251 )

In [39]:
df_nonull.isnull().sum().sum()

0

In [27]:
df_nonull.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  153 non-null    float64
 1   sepal.width   153 non-null    float64
 2   petal.length  153 non-null    float64
 3   petal.width   153 non-null    float64
 4   variety       153 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.1+ KB

In [40]:
df_nonull

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4        0.251     Setosa
1             4.9          3.0           1.4        0.251     Setosa
2             4.7          3.2           1.3        0.251     Setosa
3             4.6          3.1           1.5        0.251     Setosa
4             5.0          3.6           1.4        0.251     Setosa
..            ...          ...           ...          ...        ...
148           6.2          3.4           5.4        2.300  Virginica
149           5.9          3.0           5.1        1.800  Virginica
150           5.9          3.0           5.1        1.800  Virginica
151           5.9          3.0           5.1        1.800  Virginica
152           5.9          3.0           5.1        1.800  Virginica

[153 rows x 5 columns]

4. Identify where duplicate values are within the dataframe.

In [41]:
df.duplicated().sum()

4

In [42]:
df.loc[df.duplicated()]

     sepal.length  sepal.width  petal.length  petal.width    variety
142           5.8          2.7           5.1          1.9  Virginica
150           5.9          3.0           5.1          1.8  Virginica
151           5.9          3.0           5.1          1.8  Virginica
152           5.9          3.0           5.1          1.8  Virginica

5. Drop duplicates from the data output.

In [34]:
df_nodupes = df.drop_duplicates()

In [35]:
df_nodupes.duplicated().sum()

0

In [43]:
df_nodupes

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          NaN     Setosa
1             4.9          3.0           1.4          NaN     Setosa
2             4.7          3.2           1.3          NaN     Setosa
3             4.6          3.1           1.5          NaN     Setosa
4             5.0          3.6           1.4          NaN     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[149 rows x 5 columns]

6. Create a new column called IsSetosa that outputs "Setosa" if the variety is Setosa and "Not Setosa" otherwise.

In [46]:
iris_map= {
    'Setosa': 'Setosa',
    'Versicolor': 'Not Setosa',
    'Virginica': 'Not Setosa'
}
df['IsSetosa']=df['variety'].map(iris_map)

In [47]:
df

,sepal.length,sepal.width,petal.length,petal.width,variety,IsSetosa
0,5.1,3.5,1.4,NaN,Setosa,Setosa
1,4.9,3.0,1.4,NaN,Setosa,Setosa
2,4.7,3.2,1.3,NaN,Setosa,Setosa
3,4.6,3.1,1.5,NaN,Setosa,Setosa
4,5.0,3.6,1.4,NaN,Setosa,Setosa
...,...,...,...,...,...,...
148,6.2,3.4,5.4,2.3,Virginica,Not Setosa
149,5.9,3.0,5.1,1.8,Virginica,Not Setosa
150,5.9,3.0,5.1,1.8,Virginica,Not Setosa
151,5.9,3.0,5.1,1.8,Virginica,Not Setosa
152,5.9,3.0,5.1,1.8,Virginica,Not Setosa

7. Create a pivot table that lists the maximum sepal width for each variety.

In [44]:
#pivot_df = pd.pivot_table(df, index='variety', values='petal.width')      
#pivot_df


pivot_df = pd.pivot_table(df, index='variety', values='petal.width', aggfunc=('max'))      
pivot_df

            petal.width
variety
Setosa              0.6
Versicolor          1.8
Virginica           2.5